Comment:
Description: Imports a munki package for MacAdminsPythonRecommended
Identifier: com.github.codeskipper.munki.MacAdminsPython
ParentRecipe: com.github.jazzace.download.MacadminsPython
MinimumVersion: '2.3'

Input:
  NAME: MacAdminsPythonRecommended
  MUNKI_REPO_SUBDIR: macadmins/python
  INCLUDE_PRERELEASES: 'False'
  pkginfo:
    name: '%NAME%'
    display_name: 'MacAdmins Python Recommended'
    category: devops
    catalogs:
    - testing
    description: |
      Framework files for use with popular Python Mac Admin toolsets.
    developer: MacAdmins
    unattended_install: True
    minimum_os_version: '10.9'

Process:
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
