Comment:
Description: Creates a munki package for Mozilla Firefox, and imports it into WorkSpace ONE.
Identifier: com.github.codeskipper.ws1.MozillaFirefox
ParentRecipe: com.github.autopkg.munki.firefox-rc-en_US
MinimumVersion: '2.3'

Input:
  NAME: Mozilla Firefox
  #MUNKI_REPO_PATH: '%MUNKI_REPO%'
  LOCALE: en-US
  RELEASE: latest-esr
  pkginfo:
    name: '%NAME%'

  # WS1 specific input,  secrets
  WS1_API_USERNAME: API_USERNAME_HERE
  WS1_API_PASSWORD: API_PASSWORD_HERE
  WS1_API_TOKEN: API_TOKEN_HERE
  WS1_B64ENCODED_API_CREDENTIALS: B64ENCODED_API_CREDENTIALS_HERE
  WS1_API_URL: WORKSPACEONE_API_URL_HERE
  WS1_CONSOLE_URL: WORKSPACEONE_CONSOLE_URL_HERE
  WS1_GROUPID: GROUP_ID_HERE
  WS1_SMART_GROUP_NAME: SMART_GROUP_NAME_HERE
  WS1_PUSH_MODE: PUSH_MODE_SETTING

Process:
- Processor: com.github.codeskipper.VMWARE-WorkSpaceOneImporter/WorkSpaceOneImporter
  Arguments:
    api_token: '%WS1_API_TOKEN%'
    #munki_repo_path: '%WS1_MUNKI_REPO_PATH%'
    ws1_api_username: '%WS1_API_USERNAME%'
    ws1_api_password: '%WS1_API_PASSWORD%'
    ws1_b64encoded_api_credentials: '%WS1_B64ENCODED_API_CREDENTIALS%'
    ws1_api_url: '%WS1_API_URL%'
    ws1_console_url: '%WS1_CONSOLE_URL%'
    ws1_groupid: '%WS1_GROUPID%'
    ws1_smart_group_name: '%WS1_SMART_GROUP_NAME%'
    ws1_push_mode: '%WS1_PUSH_MODE%'
